Repository: Thea36/Assembler-Localization
Catalog: *.lproj/Localizable.strings
Languages: de

source: Create your own art!
de: Erschaffe deine eigenen Kunstwerke!

source: Chapter 8: Thank you!
de: Kapitel 8: Danke!

source: Chapter 7: Puppies!
de: Kapitel 7: Welpen!

source: Chapter 6: A nice cuppa tea
de: Kapitel 6: Eine heiße Tasse Tee

source: Chapter 5: Some Flowers
de: Kapitel 5: Danke für die Blumen

source: Chapter 4: Smile!
de: Kapitel 4: Bitte Lächeln!

source: Chapter 3: Privacy Please!
de: Kapitel 3: Privatsphäre!

source: Chapter 2: A Car
de: Kapitel 2: Das Auto

source: Chapter 1: A Runner
de: Kapitel 1: Der Läufer

source: Chapter 0: Intro
de: Kapitel 0: Intro

# moveHelp
source: With MOV (move), you can move a value into a register. After selecting MOV, you need to select a destination register. Then you can either choose a register or type in a value with the numberpad as the value you want to move.
de: Mit MOV (move/bewegen), kannst du einen Wert in ein Register bewegen.

# moveNotHelp
source: With MVN (move not) you can move an inverted value into a register. All bits in the value will be bitwise inverted. After selecting MVN, you need to select a destination register. Then you can either choose a register or type in a value with the numberpad as the value you want to move. Example of bitwise inversion: 1001 -> 0110
de: Mit MVN (move not/ nicht bewegen) wird ein invertierter Wert in ein Zielregister bewegt. Alle Bits in in dem Wert werden bitweise invertiert. Nachdem MVN ausgewählt wurde, muss ein Zielregister ausgewählt werden. Danach muss der zu bewegende Wert mit dem Nummernfeld oder durch ein Register dessen Wert genutzt werden soll eingegeben werden. Ein Beispiel für bitweise Invertierung: 1001 -> 0110

# andHelp
source: The logical AND performs a bitwise 'and' operation on the bits in the Rn register and the second operand. The result will be saved in the destination register. An 'and' operation is similar to multiplication. With AND the highest possible value is 255, where all bits are 1 in an 8 bit unsigned number. For more see 'Signed and unsigned Integers'. AND is also often represented as '&' Example: 1&1=1 1&0=0 0&0=0
de: Das logische 'und' (AND) macht eine bitweise Ver-undung zwischen den Bits des Rn-Registers und des zweiten Operands. Das Ergebnis wird dann in dem Zielregister gespeichert. Eine 'und' Operation ist ähnlich zur Multiplokation. Das höchst mögliche Ergebnis mit einer 'und' Operation ist 255, wenn es sich um vorzeichenlose Ganzzahlen (Integer) handelt. Mehr dazu findest du bei 'Vorzeichenbehaftete und vorzeichenlose Integer'. AND wird oft so dargestellt: '&' Beispiel für 'und': 1&1=1 1&0=0 0&0=0

# subHelp
source: The SUB (subtract) command works like normal subtraction does. The value of the second operand is subtracted from the value held in the Rn register specified. The answer will be saved in the destination register specified at first. The minimal value possible here is zero.
de: Das SUB (subtraktion) funktioniert genauso wie normale Subtraktion. Der Wert des zweiten Operands wird vom Wert des Rn-Registers abgezogen und im Zielregister gespeichert. Mit SUB ist es möglich einen sogenannten UNDERFLOW zu erzeugen. Dies passiert, wenn der errechnete Wert kleiner als der minimal Mögliche ist. Bei vorzeichenlosen Ganzzahlen ist das 0. Hier können keine Werte kleiner als 0 entstehen. Das habe ich vorher ausgeschlossen, da die App sonst abstürzen würde.

# bicHelp
source: With BIC (bit clear) bits in the register specified can be cleared with the bitmask specified as the second operand. You need to enter a destination register and a register with the value you want to change. The second operand needs to be a bitmask, so the bits you want to clear need to be ones. Example without registers: BIC 1011, 1000 -> 0011
de: Mit BIC (bit clear/Bit löschen) kann man Werte in einem Register auf Null setzten. Dabei wird der zweite Operand als Bitmaske genuztzt. Bei jeder 1 in der Maske wird im Zielregiser eine 0 gesetzt. Das Rn bestimmt welche 1en bleiben dürfen. Beispiel ohne Angabe von Registern: BIC Ziel, 1011, 1000 -> 0011

# orrHelp
source: The ORR operator performs a bitwise 'or' operation on the bits in the Rn register and the second operand. The result is going to be saved in the destination register. An 'or' operation is similar to addition. ORR is also often represented as '|' Example: 1|1=1 1|0=1 0|0=0
de: Mit ORR kann ein bitweises 'oder' zwischen den Bits im Rn und im zweiten Operand ausgeführt werden. Das Ergebnis wird im Zielregister gespeichert. Ein 'oder' ist so ähnlich wie Addition. ORR wird häufig so dargestellt: '|' Beispiel: 1|1=1 1|0=1 0|0=0

# eorHelp
source: With EOR, you can performs a bitwise 'exclusive or' operation on the bits in the Rn register and the second operand. The result is saved in the destination register. An 'exclusive or' operation checks if the bits are different from each other. Example: EOR 1,1 -> 0 EOR 1,0 -> 1 EOR 0,0 ->0
de: Mit EOR, kannst du bitweise 'exklusiv oder' operationen mit den Bits in Rn und denen im zweiten Wert ausführen. Das Ergebnis wird im Zielregister gespeichert. Ein 'exklusiv oder' prüft ob die Bits verschieden sind. Beispiel ohne Nennung von Registern: EOR 1,1 -> 0 EOR 1,0 -> 1 EOR 0,0 ->0

# addHelp
source: ADD adds the value in Rn to the value specified in the second operand. The result is then saved in the destination register. With this operation you can get values exceeding the maximum of an 8 bit number (max is 255). So you would need to check that you dont add values with a result exceeding 255. Here, all numbers over 255 will be 255.
de: ADD addiert den Wert im Rn und den im zweiten Operand. Das Ergebnis wird im Zielregister gespeichert. Mit ADD kann ein OVERFLOW entstehen. Dies passiert, wenn die Summe der beiden Werte größer ist, als der maximal Mögliche. Bei 8 Bit und vorzeichenloser Interpretation ist das Maximum 255. Da die App sonst abstürzen würde, habe ich vorher ausgeschlossen, dass dies passieren kann.

# firstChapterIntroText
source: The only command here is MOV, meaning 'move'. With MOV you can move a value into a destination register. The destination has to be selected first. The value can be entered with the numberpad, or you can move antother registers value. to do that you simply select the other register instead of a value.
de: Der einzige Befehl hier ist MOV. Mit MOV kannst du einen Wert in ein Register eintragen. Dieser Wert kann entweder mit dem Nummernfeld eingetragen werden, oder indem du ein Register angibst, dessen Wert du bewegen möchtest. Als Erstes musst du den Befehl auswählen, dann das Zielregister in das du den Wert bewegen möchtest. Als Letztes gibst du dann den Wert an.

# secondChapterIntroText
source: The next chapter introduces you to a new command. MVN, which means 'move not'. The MVN command inverts every bit in the operand (a 1 becomes a 0, and a 0 becomes a 1) and moves the resulting value into the destination register. As with MOV you first need to select the command, then the destination and then you can enter the operand.
de: Das Nächste Kapitel hat einen neuen Befehl. MVN, das bedeutet move not, invertiert bewegen. Der MVN Befehl invertiert alle Bits im Operanden (eine 1 wird zur 0, eine 0 zur 1) und bewegt diese dann in das Zielregister. Wie bei MOV musst du zuerst der Befehl, dann das Ziel und zum Schluss dann ein Register dessen Wert du bewegen möchtest oder einen Wert mit dem Nummernfeld eingeben.

# thirdChapterIntroText
source: In this chapter you'll be introduced AND and ORR. AND and ORR are a bit different than MOV/MVN. They first have a destination register an then two operands. The first operand needs to be a register, the second one can be a register or a value from the numberpad. The two operands will beused to perform a bitwise operation, and the result will be stored in the destination register. AND works a bit like multiplication, an AND with 0 makes a 0, an and with two 1s makes a 1. ORR (or) on the other hand works a bit like addition, where 1+0 make 1 and 1+1 makes 1 (that's a bit confusing, but a bit can't be more than 1). I work for a car company and my friends are worried that I'm going to sell them a car. I don't need to sell you a car, because in the next chapter, you will assemble one!
de: In diesem Kapitel kannst du AND und ORR ausprobieren. Diese sind ein bisschen anders als MVN/MOV. Bei ihnen musst du auch zuerst den Befehl und dann das Ziel auswählen, jedoch musst du hier zwei Operanden angeben, die miteinender verglichen werden sollen. Der Erste kann dabei ein Register oder Nummernfeldwert sein, der zweite Operand muss jedoch mit dem Nummernfeld eingegeben werden. AND ist ein bisschen so wie Multiplikation. 0 und 0 ergibt 0, 0 und 1 ergibt 0, 1 und 1 ergibt 1. ORR ist eher wie Addition. 1+0=1, doch 1+1 ist ebenfalls 1. Ich arbeite für eine Firma die Autos herstellt und meine Freunde machen sich manchmal Sorgen, dass ich ihnen ein Auto verkaufen will. Dir muss ich jedoch Keins verkaufen, denn im nächsten Kapitel wirst du Eins bauen!

# fourthChapterIntroText
source: With assembly you can also use normal addition and subtraction. So you can try this in the following chapter. The key problem with addition and subtraction is that you can cause an over- or underflow. An overflow happens when you try to store a value larger than the available bits can hold. So here any value larger than 255 (2^8 -1) would crash the program. Here this doesn't happen. An underflow is just like an overflow, just with values lower that the bits can hold. Here, the lowest value possible is 0.
de: Mit Assembly kannst du auch normale Subtraktion und Addition verwenden. Deshalb kannst du das im nächsten Kapitel ausprobieren. Das Problem mit Addition und Subtraktion ist, dass du einen OVERFLOW oder UNDERFLOW erzeugen kannst. Dann stürzt dein Programm ab. Bei einem Underflow versuchst du einen kleineren Wert als das Minimum einzutragen. Bei einem Overflow versuchst du einen Wert grüßer als das Maximum einzutragen. Hier brauchst du dir jedoch keine Sorgen zu machen, ich habe verhindert dass das passieren kann. Das Maximum ist, wenn alle Bits 1 sind, das Minimum, wenn alle Bits 0 sind.

# fifthChapterIntroText
source: For the next chapter only one new operator is intorduced: BIC (bit clear). With it you can clear bits. This means that you can set bits to zero. An Example would be BIC 1111, 0100 -> 1011. You could see it as an AND with an inverted value. As a help you also have the ORR operator to set bits to 1 again. Can you solve the level with just using BIC?
de: Für das nächste Kapitel gibt es nur einen neuen Befehl. BIC (bit clear/Bit löschen). Das bedeutet, dass du bits nicht nur setzen kannst (wie mit ORR) sonder auch lschen kannst. Der zweite operand wird dabei als Bitmaske verwendet. An jeder Stelle an der die Maske eine 1 hat, wird eine 0 ins Ziel gesetzt. Kannst du das Kapitel nur mit BIC lösen?

# sixthChapterIntroText
source: The EOR operator is the last missing logic opperator. So now you'll have time to learn it. With EOR (exclusive or) you can find out, if bits are different from each other. Here an example: EOR 0101, 1001 -> 1100. If the two bits compared are equal, a zero is set as the result. If they differ, a one is set as the result. With EOR you will also have the ORR operator to fill in bits. Try to use EOR at least once.
de: EOR ist der letzt logische Operator. Mit EOR (exklusives oder) kannst du prüfen ob zwei Bits unterschiedich sind. Eine 1 und eine 0 ergeben eine 1, zwei 0en ergeben eine 0,zwei 1en ergeben ebenfalls eine 0. Hier ein Beispiel: EOR 0101, 1001 -> 1100. Versuch es doch mal!

# seventhChapterIntroText
source: This chapter only has AND.
de: In diesem Kapitel gibt es nur AND. Manche sagen, dass ist nicht möglich! Doch es ist möglich, dass Kapitel nur mit AND zu lösen. Schaffst du das?

# eightChapterIntroText
source: In this chapter you only have BIC.
de: Hier gibt es nur BIC. Pass auf dass du dich nicht vertippst; sonst musst du von vorne anfangen.

# ninthChapterIntroText
source: In the next chapter you will be able to use all commands.
de: In diesem Kapitel kannst du alle Befehle nutzen. Viel Spaß.

# zenChapterIntroText
source: Thank you for playing. I hope you had a bit of fun and I hope you leraned something new. Next you'll be able to make your own art with all commands. There is no solution to it.
de: Danke! Ich feue mich, dass du es bis hier hin geschafft hast. Ich hoffe du hattest Spaß und hast vielleicht sogar ein bisschen was Neues gelernt. Als nächstes kannst du deine eigenen Kunstwerke erschaffen. Es gibt also keine Lösung, aber du kannst alle Befehle nutzen.

source: Meet the Team
de: Lerne das Team kennen

source: Programming and Creative Things
de: Programmierung und kreative Sachen

source: Couldn't find a better picture.
de: Hat kein beseres Foto gefunden

# introLenaText
source: I love coding and drawing. In my free time I read a lot. I really like uni and the people I study and work with.
de: Ich liebe programmieren und zeichnen. In meiner freien Zeit lese ich viel. Ich studiere sehr gerne Informatik und liebe die Leute mit denen ich arbeite und lerne.

source: Mental Health and Tennisballs
de: Gesundheit und Tennisbälle

source: A good girl.
de: Ein sehr guter Hund

# LakshmiQuote
source: 'I've given her this tip many times, but Lena wont listen: Buy more treats for me!'
de: 'Ich habe ihr das schon mehrfach gesagt; aber Lena kauft einfach nicht mehr Leckerlies für mich!'

# LakshmiIntro
source: Lakshmi is the sweetest soul, she reminds me to be happy and to go outside on long walks with her. She loves playing fetch.
de: Lakshmi ist eine treue Seele, sie erinnert mich daran glücklich zu sein und lange Spaziergänge zu machen. Sie liebt es mit Tennisbällen zu spielen.

source: Special thanks to my friends and family. I love you all ♥️
de: Besonderer Dank gilt meinen Freunden und meiner Familie. Ich hab euch lieb ♥️

source: Ps: Lakshmi had more than enough treats.
de: Ps: Lakshmi hatte mehr als genug Leckerlies

source: This App was made for and won in the 2022 Swift Student Challenge.
de: Dies App wurde für die Swift Student Challenge 2022 gemacht und hat gewonnen.

source: Welcome!
de: Willkommen!

source: Select Comand
de: Befehl auswählen

source: Start next chapter
de: Nächstes Kapitel starten

source: UP NEXT
de: ALS NÄCHSTES

source: COMMANDS IN THE NEXT CHAPTER
de: KOMANDOS IM NÄCHSTEN KAPITEL

# assemblyTrivia
source: Did you know that Assembly is case insensitive? This means that you can write commands in caps (like done here) or lowercased.
de: Wusstes du, dass es Assembly egal ist, ob du mit Groß- oder Kleinbuchstaben schreibst? Das bedeutet, dass du die Befehle auch klein schreiben kannst. Hier schreibe ich sie jedoch groß, da ich das schöner finde.

# signedUnsigned
source: There are differnt Types of Integers; signed and unsigned. The main difference is the values they can hold. An unsigned Integer with 8 bits has a minimum of 0 and a maximum value of 255. A signed one can hold values between -128 and 127. The maximum value is reached, whe all bits are 1. the minimum when all bits are 0. For signed Integers, the maximum value is and the minimum value is . They can hold the same range of numbers. The only difference is in the definiton of the minimum and maximum. Technically the types are the same and the existence of a sign is only a question of interpretation. The difference needs to be made as it can cause overflow/underflow conditions or falsely interpreted values.
de: Es gibt verschiedene Typen von Integern (Ganzzahlen). Es gibt Vorzeichenbehaftete und Vorzeichenlose. Eigentlich sind die beiden Typen gleich, die Existenz eines Vorzeichen ist nur eine unterschiedliche Interpretation der Bits. Vorzeichenbehaftet bedeutet, dass ein Wert positiv oder negativ sein kann. Also bei 8 Bit können die Zahlen von -128 bis 127 dargestellt werden. Zusammen mit der Null sind das 2 hoch 8 = 256 unterschiedliche Zahlen. Vorzeichenlos bedeutet, dass ein Wert nur positiv sein kann. Somit können Zahlen zwischen 0 und 255 dargestellt werden. Das sind zusammen mit der Null ebenfalls 2 hoch 8 = 256 verschiedene Zahlen. Die beiden Typen werden unterschieden, da Zahlen sonst falsch interpretiert werden oder UNDERFLOWS/OVERFLOWS entstehen können. Das Maximum ist erreicht wenn alle Bits 1 sind, das Minimum wenn alle 0 sind. Deshalb können Werte nicht größer sein als das Maximum, die Bits können ja nicht mehr 1 sein als sie es schon sind.

# calculations
source: To convert binary numbers to decimal numbers (the ones we are using in our daily lives) you need to know which one is the bit with the highest value. There are only two possibiliys for that; either its the one on the far left (so, the one on the smallest adress, also called little Endian), or the one on the far right (the one on the biggest adress, also called big endian). Ofcourse there are a lot of converters on the web, and its unlikely that you need to convert binary numbers by hand, but if you wanted to, this is how you would do it: You would write the values of the bit next to each other. Here, the values are already written underneath the bit-grid. Theny you would write the binary number above or underneath those values. For every 1 you add the value over/under it together.
de: Um binäre Zahlen in Dezimalzahlen (die, die wir im normalen Leben nutzen) zu konvertieren, musst du zuerst wissen, welches das Bit mit dem höchsten Wert ist. Es gibt da nur zwei Möglichkeiten. Entweder ist es das Bit, welches an der niedrigsten Adresse steht (auch Little Endian genannt), oder das Bit welches an der höchsten Adresse steht (auch Big Endian genannt). Man kann das auch als vorwärts oder rückwärts lesen betrachten. Je nachem in welche Richtung das Register gelesen wird, hat es unterschiedliche Werte. Hier werden die Werte von rechts nach links gelesen. Das Bit mit dem höchsten Wert ist also auf der linken Seite. Was bedeutet 'Bit mit höchstem Wert' eigentlich? Beim Konvertieren wird jedem Bit ein dezimaler Wert zugewiesen. Die Werte sind Potenzen von 2. Das Bit rechts hat hier also einen Wert von 1, das daneben 2, dann 4, dann 8 usw. Das bedeutet, wenn die binäre Zahl 1001 wäre, dann würden wir eine 1 für das letzte Bit aufschreiben und eine 8 für das Erste. Diese beiden Zahlen müssen dann addiert werden. Also wird aus 1001 eine 9. Am einfachsten ist es, wenn du für jedes Bit den Wert darunter schreibst und dann die durchstreichst, deren Bit eine 0 ist. Hier kannst du es testen.

source: Try changing the result by tapping the bits
de: Versuche das Ergebnis zu verändern indem du die Bits antippst.

source: 'Destination' means a register
de: 'Destination' meint ein Register

source: 'Rn' means a register
de: 'Rn' meint ein Register

source: 'Operand(2)' means a register or a value typed in with the numberpad
de: 'Operand(2)' meint ein Register oder einen Wert der mit dem Nummernfeld eingegeben wurde

source: Signed and unsigned Integers
de: Vorzeichenbehaftete und vorzeichenlose Integer

source: Converting to decimals
de: Konvertierung ins Dezimalsystem

source: Trivia
de: Unnützes Wissen

source: Privacy Policy
de: Datenschutzerklärung

# Herzlich Willkommen!
source: Welcome!
de: Herzlich Willkommen!

# Intro1.1
source: Welcome at 'The Assembler'! Thank you for downloading the app. Here you can use Assembly and logical operations to create little pieces of art.
de: Willkommen bei Assembler! Danke, dass du die App herruntergeladen hast. Hier kannst du mit Asssembly und logischen Operatoren kleine Kunstwerke erschaffen

# Intro1.2
source: Hav you ever thought about why nubmers have a certain value? Let us define, that we use symbols (letters, numbers, emojis, signs) to describe a value.
de: Hast du schon mal darüber nachgedacht, warum Zahlen einen bestimmten Wert haben? Lass uns definieren, dass Symbole (Buchstaben, Ziffern, Emojis, Zeichen) genutzt werden, um Werte zu beschreiben.

# Zahlensysteme (vereinfacht)
source: Number system (simplified)
de: Zahlensysteme (vereinfacht)

# Intro2.1
source: Values can be easily converted between different systems, like yards to meters. So in essence, you can use different symbols to display the same value. An example would be the roman number system. Where a 'V' means '5' and an 'I' means '1'.
de: Werte können zwischen verschiedenen Systemen umgewandelt werden, so wie z.B. Meter in Yards. Du kannst also verschiedene Symbole nutzen, um das Gleiche darzustellen. Als Beispiel: 'A' könnte '1' bedeuten, 'B' '2' usw. In den römischen Zahlen bedeutet 'V' '5' und 'I' '1'.

# Intro2.2
source: There are many such systems. The decimal system uses 10 symbols (0-9). The binary system uses only two (0-1).
de: Im mathematischen nennt man diese Systeme 'Zahlensysteme'. Das Dezimalsystem nutzt die Ziffern 0 bis 9 um Werte zu beschreiben. Im Binärsystem wird nur 0 und 1 benutzt.

# Intro2.3
source: One of the most importatnt things for a number system is, that maths still needs to work. If you add two values in binary, the result needs to be the same value as in all other number systems. That way, values van be converted to the decimal system, and then be calculated there.
de: Eine der wichtigsten Regeln ist jedoch, dass das Verrechnen von Werten in anderen Zahlensystemen zu den gleichen Werten führen muss. Da Rechnen im Binärsystem also immer noch funktioniert, können alle Werte einfach ins Binärsystem umgewandelt und dort berechnet werden.

# Computer (stark vereinfacht)
source: Computers (overly simplified)
de: Computer (stark vereinfacht)

# Intro3.1
source: Computers are made up from logical gates. Billions of them. They can decide to turn 'power on' (1) or to turn 'power off' (0). Just like zero and one in the binary system. One zero/one in binary is called 'Bit'
de: Computer sind aus logischen Gattern zusammengesetzt. Milliarden davon. Diese können die Entscheidung treffen, ob sie 'Strom an' (1) oder 'Strom aus' (0) ausgeben. Also genau wie Null und Eins im Binärsystem. Eine Ziffer im Binärsystem nennt man Bit.

# Intro3.2
source: Because gates can only decide between 0 and 1, computers simply do theri calculations in the binary system. After that, the values only need to be converted back to the decimal system. Computers can convert values to the binary system, there they can save them and do calculations with them.
de: Computer rechnen einfach im Binärsystem, da Gatter nur 0 und 1 können. Danach müssen die Werte nur zurück konvertiert werden. Computer können Zahlen ins Binärsystem umwandeln, dort können sie diese speichern und verarbeiten.

# Intro3.3
source: Gates themselves can only make descisions, not save things. When combining multiple gates in a loop, you can create so called FlipFlops to save one Bit. with multiple FlipFlops you ccan build registers. These can save multiple bits, like 8, 16, 32.
de: Einzelne Gatter können jedoch nur Entscheidungen treffen und nichts speichern. Kombiniert man mehrere Gatter, kann man ein Bit speichern. Eine solche Kombination aus Gattern nennt man FlipFlops. Mit mehreren FlipFlops baut man Register. Diese können dann mehrere Bits (z.B. 8, 16, 32) speichern.

# Assembly (vereinfacht)
source: Assembly (simplified)
de: Assembly (vereinfacht)

# Tippe mich an!
source: Tap me!
de: Tippe mich an!

# Intro4.1
source: In Assembly you can manipulate the values saved in the registers. The registers here have 8 bit each. 8 bit are called 1 byte. To recognise values in the binary system, they are prefixed with a '0b'.
de: In Assembly kann man dann die Werte, die in den Registern gespeichert sind bearbeiten. Die Register hier haben 8 Bit. 8 Bit nennt man 1 Byte. Um Zahlen im Binärsystem von Dezimalzahlen zu unterscheiden, werden Erstere mit 0b am beginnend gekennzeichnet.
