Repository: Thea36/Assembler-Localization
Catalog: *.lproj/Localizable.strings
Languages: de

# Intro4.2
source: Assembly is a very low level programming language. Which operators are available in Assembly is decided by the gates used int the computer. So assembly is a bit different for each type od computer.
de: Assembly ist eine sehr einfache Programmiersprache. Welche Operatoren in Assembly genutzt werden können, hängt davon ab, was für Gatter im Computer verbaut sind. Deshalb ist Assembly ein bisschen anders für jeden Typ von Computer.

source: A Button with the number 0
de: Ein Button mit der Nummer 0

source: A 0 will be added to the binary number you're entering.
de: Eine 0 wird der eingegebenen binären Zahl hinzugefügt.

source: A button with the number 1
de: Ein Button mit der Nummer 1

source: A 1 will be added to the binary number you're entering.
de: Eine 1 wird der eingegebenen binären Zahl hinzugefügt.

# Auswählen eines Registers
source: Choose a register
de: Auswählen eines Registers

# Auswählen eines Komandos
source: Choose a command
de: Auswählen eines Befehls

# Komando
source: Command
de: Befehl

# Register %@ mit Wert %@ soll Wert %@ haben
source: Register %@ with value %@ should have value %@
de: Register %@ mit Wert %@ soll Wert %@ haben

source: Picture of me
de: Ein Foto von mir

source: Picture of Lakshmi, a chocolate Labrador
de: Ein Foto von Lakshmi, einem braunen Labrador

source: %@ Bits next to each other.
de: %@ Bits nebeneinander.

source: A visualization of a Bit. It has a value of %@
de: Ein Bit mit dem Wert %@

source: A visualisation of an 'AND' gate. The inputs are 1 & 0, the result is 0
de: Ein 'UND' Gatter. Die Inputs sind 1 & 0, das Ergebnis ist 0.

source: A visualisation of an 'AND' gate. The inputs are 1 & 1, the result is 1
de: Ein 'UND' Gatter. Die Inputs sind 1 & 1, das Ergebnis ist 1.

source: A visualisation of an 'AND' gate. The inputs are 0 & 1, the result is 0
de: Ein 'UND' Gatter. Die Inputs sind 0 & 1, das Ergebnis ist 0.

source: Decimal to binary conversion
de: Dezimal zu binär Umrechnung

source: 0 becomes 0b0
de: 0 wird 0b0

source: 1 becomes 0b1
de: 1 wird 0b1

source: 2 becomes 0b0.1
de: 2 wird 0b0.1

source: 3 becomes 0b11
de: 3 wird 0b11

source: A view showing how differnet symbols can be used to describe the same value. The examples are the number 10, the word code, the concept of music, and the nuber 5.
de: Eine Ansicht die zeigt wie verschiedene Symbole genutzt werden können um gleiche Werte darzustellen. Die Beispiele sind die nummer 10, das wort 'code', das konzept Musik und die nummer 5.

source: Emoji H.T.M.L like code
de: Emoji mit H.T.M.L mäßigem code

source: Emoji of Guitars
de: Emoji mit Gitarren

source: Emoji of a Dice showing the number 5
de: Emoji eines Würfels mit der Nummer 5

source: Two images, one showing a cmputer chip and one showing a cpu.
de: Zwei Bilder, eins zeigt einen Computerchip und eins zeigt eine CPU.

source: A four bit register with the value 0. Then the value 7 is moved into it. Now the register reads 0.1.1.1 in binary. Then 0.0.0.1 is moved into the register. it now reads 0.0.0.1.
de: Ein 4 Bit register mit dem Wert 0. Dann wird der wert 7 hinein bewegt. In Binär steht jetzt 0111 im Register. Dann wird 0001 ins register bewegt. Nun steht 0001 im Register.

source: A visualisation of a 4 bit register with the value 12. or 1.1.0.0 in binary. Through tapping you can change the value by toggeling the bits between 0 & 1.
de: Ein 4 Bit Register mit dem Wert 12. oder 1.1.0.0 in Binär. Durch klicken kannst du den Wert der Bits ändern.

source: A visualisation of an 8 bit register with the value 240. or 1.1.0.0 in binary. Through tapping you can change the value by toggeling the bits between 0 & 1.
de: Ein 8 Bit register mit dem Wert 240, oder 1.1.0.0 in Binär. Durchanklicken kannst du den Wert der Bits ändern.

source: A view showing 1+1 in binary system, as well as 1+1 in the decimal system. Both have the same result.
de: Ein Bild welches 1+1 im binären sytem sowie im dezimalen System zeigt. Beide Rechnungen haben das gleiche Ergebnis.

source: A visualisation of how the value 5 can look in different systems. There is a 5 in binary, a 5 on a dice, a 5 as a 'V' in roman numbers.
de: Der Wert 5 in unterschiedlichen Zahlensystemen. Dort ist die 5 in Binär, eine 5 auf einem Würfel, 5 als 'V' in römischen Zahlen.

# You have caused an overflow! Unexpected behaviour might follow.
source: You have caused an overflow!The value was larger than the register can hold. Unexpected behaviour might follow.
de: Du hast einen Overflow (Überlauf) ausgelöst! Der Wert ist größer als das Register halten kann. Unerwartetes kann passieren.

# You have caused an underflow! Unexpected behaviour might follow.
source: You have caused an underflow! The value was smaller than the register can hold. Unsigned Integers cannot hold negative numbers. Unexpected behaviour might follow.
de: Du hast einen Underflow (Unterlauf) ausgelöst! Der Wert ist kleiner als das Register halten kann. Vorzeichenlose Integer können keine negativen Werte halten. Unerwartetes kann passieren.

source: Help translating this app
de: Hilf diese App zu Übersetzen

source: If the first bit is 1, all the other bits need to be inverted. The first bit is used to show the sign of the value.
de: Wenn das erste Bit 1 ist, dann müssen alle anderen Bits invertiert werden (Einerkomplement). Das erste Bit zeigt das Vorzeichen an.

source: This value is now multiplied with -1.
de: Dieser Wert wird nun mit -1 multipliziert

source: Now 1 is subtracted from the value
de: Jetzt zieht man noch 1 ab. Das ist das Zweierkomplement.

source: Show Intro Again
de: Intro nochmal ansehen
